# FaceWall Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceWall Class
Members See Also
---
A wall attached to a non-vertical massing face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FaceWall : HostObject
```

Visual Basic
---
```text
Public Class FaceWall _
	Inherits HostObject
```

Visual C++
---
```text
public ref class FaceWall : public HostObject
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..FaceWall
# See Also
FaceWall Members
Autodesk.Revit.DB Namespace